.kiro/perf/smoke.yml
config:
  target: "http://localhost:3001/api"
  phases:
    - duration: 30
      arrivalRate: 5
scenarios:
  - name: Health and tickets smoke
    flow:
      - get:
          url: "/health/summary"
      - get:
          url: "/tickets?limit=10"
      - get:
          url: "/tickets/search/advanced?q=test&limit=5"